{
	"tweets":
		[
			"Best Jobs Numbers in the history of our great Country! Many other things likewise. So why wouldn’t we win the Midterms? Dems can never do even nearly as well! Think of what will happen to your now beautiful 401-k’s!",
			"The Caravans are a disgrace to the Democrat Party. Change the immigration laws NOW!",
			"Full efforts are being made to stop the onslaught of illegal aliens from crossing our Souther Border. People have to apply for asylum in Mexico first, and if they fail to do that, the U.S. will turn them away. The courts are asking the U.S. to do things that are not doable!",
			"Watched North Dakota’s Rep. Kevin Cramer easily win debate with Senator Heidi Heitkamp. Great job Kevin, you will be a great Senator!",
			"All levels of government and Law Enforcement are watching carefully for VOTER FRAUD, including during EARLY VOTING. Cheat at your own peril. Violators will be subject to maximum penalties, both civil and criminal!",
			"Heading to Nevada to help a man who has become a good friend, Senator Dean Heller. He is all about #MAGA and I need his Help and Talent in Washington. Also, Adam Laxalt will be a GREAT GOVERNOR, and has my complete and total Endorsement. Winners Both!",
			"Leaving Arizona after a fantastic Rally last night, in Mesa, honoring, and for, Martha @RepMcSally McSally. She is an inspiration & will be a GREAT SENATOR for the people of Arizona. Her opponent is a Nancy Pelosi puppet, really bad for State. Early Voting NOW! Will be back soon.",
			"Rick Scott is known as easily one of the best Governors in the USA. Florida is setting records in almost every category of success. Amazing achievement-the envy of the World. Ron DeSantis will build on this success. His incompetent opponent will destroy Florida - next Venezuela!",
			"Ron @RonDeSantisFL DeSantis is working hard. A great Congressman and top student at Harvard & Yale, Ron will be a record setting governor for Florida. Rick Scott gave him tremendous foundations to further build on. His opponent runs one of the worst & most corrupt cities in USA!",
			"Georgia Secretary of State Brian Kemp will be a great governor. He has been successful at whatever he has done, and has prepared for this very difficult and complex job for many years. He has my Strong Endorsement. His opponent is totally unqualified. Would destroy a great state!",
			"If the Democrats would stop being obstructionists and come together, we could write up and agree to new immigration laws in less than one hour. Look at the needless  pain and suffering that they are causing. Look at the horrors taking place on the Border. Chuck & Nancy, call me!",
			"Beto O’Rourke is a total lightweight compared to Ted Cruz, and he comes nowhere near representing the values and desires of the people of the Great State of Texas. He will never be allowed to turn Texas into Venezuela!",
			"Secretary of State Mike Pompeo was never given or shown a Transcript or Video of the Saudi Consulate event. FAKE NEWS!",
			"When referring to the USA, I will always capitalize the word Country!",
			"Jon Tester says one thing to voters and does the EXACT OPPOSITE in Washington. Tester takes his orders form Pelosi & Schumer. Tester wants to raise your taxes, take away your 2A, open your borders, and deliver MOB RULE. Retire Tester & Elect America-First Patriot Matt Rosendale!",
			"The only thing keeping Tester alive is he has millions and millions of dollars from outside liberals and leftists, who couldn’t care less about our Country!",
			"Will be landing soon. Looking forward to seeing our next Senator from Montana, Matt Rosendale. He will represent our Country well, far better than Jon Tester who will vote with Cryin’ Chuck Schumer and Nancy Pelosi - never with us!",
			"All Republicans support people with pre-existing conditions, and if they don’t, they will after I speak to them. I am in total support. Also, Democrats will destroy your Medicare, and I will keep it healthy and well!",
			"Congressman @DaveBratVA7th is one of the hardest working, and smartest, people in Washington. He is strong on the Border, Crime, the Military, our Vets and the 2nd Amendment. He is a powerful vote for MAGA and loves the Great State of Virginia. Dave has my Total Endorsement!",
			"Ever since his vicious and totally false statements about Admiral Ron Jackson, the highly respected White House Doctor for Obama, Bush & me, Senator John Tester looks to be in big trouble in the Great State of Montana! He behaved worse than the Democrat Mob did with Justice K!",
			"I am watching the Democrat Party led (because they want Open Borders and existing weak laws) assault on our country by Guatemala, Honduras and El Salvador, whose leaders are doing little to stop this large flow of people, INCLUDING MANY CRIMINALS, from entering Mexico to U.S.....",
			"....In addition to stopping all payments to these countries, which seem to have almost no control over their population, I must, in the strongest of terms, ask Mexico to stop this onslaught - and if unable to do so I will call up the U.S. Military and CLOSE OUR SOUTHERN BORDER!..",
			"....The assault on our country at our Southern Border, including the Criminal elements and DRUGS pouring in, is far more important to me, as President, than Trade or the USMCA. Hopefully Mexico will stop this onslaught at their Northern Border. All Democrats fault for weak laws!",
			"Congressman Neal Dunn (@DunnCampaign) of Florida has done an outstanding job at everything having to do with #MAGA. Now working hard on hurricane relief and rebuild. Strong on Crime, strong on Borders, loves our Military and our Vets. Neal has my highest Endorsement!",
			"College educated women want safety, security and healthcare protections – very much along with financial and economic health for themselves and our Country. I supply all of this far better than any Democrat (for decades, actually). That’s why they will be voting for me!",
			"Republicans must make the horrendous, weak and outdated immigration laws, and the Border, a part of the Midterms!",
			"Hard to believe that with thousands of people from South of the Border, walking unimpeded toward our country in the form of large Caravans, that the Democrats won’t approve legislation that will allow laws for the protection of our country. Great Midterm issue for Republicans!",
			"AP headline was very different from my quote and meaning in the story. They just can’t help themselves. FAKE NEWS!",
			"Ted Cruz has done so much for Texas, including massive cuts in taxes and regulations - which has brought Texas to the best jobs numbers in the history of the state. He watches carefully over your 2nd Amendment. O’Rourke would blow it all! Ted has long had my Strong Endorsement!",
			"Watched the debate last night & Beto O’Rourke, who wants higher taxes and far more regulations, is not in the same league with Ted Cruz & what the great people of Texas stand for & want. Ted is strong on Crime, Border & 2nd A, loves our Military, Vets, Low Taxes. Beto is a Flake!",
			"Elizabeth Warren is being hammered, even by the Left. Her false claim of Indian heritage is only selling to VERY LOW I.Q. individuals!",
			"Anybody entering the United States illegally will be arrested and detained, prior to being sent back to their country!",
			"We have today informed the countries of Honduras, Guatemala and El Salvador that if they allow their citizens, or others, to journey through their borders and up to the United States, with the intention of entering our country illegally, all payments made to them will STOP (END)!",
			"WOW, John James is making headway in Michigan. We are bringing jobs back to the State, and the People of Michigan appreciate it. Debbie Stabenow has been no help, if anything, a major hindrance. John James is a star, I hope the voters see it. Polls are tightening!",
			"Is it really possible that Bruce Ohr, whose wife Nellie was paid by Simpson and GPS Fusion for work done on the Fake Dossier, and who was used as a Pawn in this whole SCAM (WITCH HUNT), is still working for the Department of Justice????? Can this really be so?????",
			"“Conflict between Glen Simpson’s testimony to another House Panel about his contact with Justice Department official Bruce Ohr. Ohr was used by Simpson and Steele as a Back Channel to get (FAKE) Dossier to FBI. Simpson pleading Fifth.” Catherine Herridge. Where is Jeff Sessions?",
			"The United States has strongly informed the President of Honduras that if the large Caravan of people heading to the U.S. is not stopped and brought back to Honduras, no more money or aid will be given to Honduras, effective immediately!",
			"Now that her claims of being of Indian heritage have turned out to be a scam and a lie, Elizabeth Warren should apologize for perpetrating this fraud against the American Public. Harvard called her “a person of color” (amazing con), and would not have taken her otherwise!",
			"Just spoke to the King of Saudi Arabia who denies any knowledge of whatever may have happened “to our Saudi Arabian citizen.” He said that they are working closely with Turkey to find answer. I am immediately sending our Secretary of State to meet with King!",
			"Will be leaving for Florida and Georgia with the First Lady to tour the hurricane damage and visit with FEMA, First Responders and Law Enforcement. Maximum effort is taking place, everyone is working very hard. Worst hit in 50 years!",
			"The crowds at my Rallies are far bigger than they have ever been before, including the 2016 election. Never an empty seat in these large venues, many thousands of people watching screens outside. Enthusiasm & Spirit is through the roof. SOMETHING BIG IS HAPPENING - WATCH!",
			"NBC News has totally and purposely changed the point and  meaning of my story about General Robert E Lee and General Ulysses Grant. Was actually a shoutout to warrior Grant and the great state in which he was born. As usual, dishonest reporting. Even mainstream media embarrassed!",
			"Big day! Pastor Andrew Brunson, who could have spent 35 years in a Turkish prison, was returned safely home to his family today. Met in Oval Office, great people! Then off to Kentucky for a Rally for Congressman Andy Barr. Tremendous crowd & spirit! Just returned to White House.",
			"Heading to the Great State of Kentucky - Big Rally for Congressman Andy Barr - Fantastic guy, need his vote for MAGA! Strong on Crime, Tax Cuts, Military, Vets & 2nd A. His opponent will NEVER vote for us, only for Pelosi. Andy has my Strongest Endorsement!!! See you in Kentucky.",
			"Highly respected Congressman Keith Rothfus (R) of Pennsylvania is in the fight of his life because the Dems changed the District Map. He must win. Strong on crime, borders, big tax & reg cuts, Military & Vets. Opponent Lamb a Pelosi puppet-weak on crime. BIG ENDORSEMENT FOR KEITH",
			"There was NO DEAL made with Turkey for the release and return of Pastor Andrew Brunson. I don’t make deals for hostages. There was, however, great appreciation on behalf of the United States, which will lead to good, perhaps great, relations between the United States & Turkey!",
			"So nice, everyone wants Ivanka Trump to be the new United Nations Ambassador. She would be incredible, but I can already hear the chants of Nepotism! We have great people that want the job.",
			"Walker Stapleton is running as the highly respected Republican Candidate for Governor of the Great State of Colorado. His credentials and talents are impeccable. He has my complete and total Endorsement!",
			"The paid D.C. protesters are now ready to REALLY protest because they haven’t gotten their checks - in other words, they weren’t paid! Screamers in Congress, and outside, were far too obvious - less professional than anticipated by those paying (or not paying) the bills!",
			"Every day, our police officers race into darkened allies, deserted streets, & onto the doorsteps of the most hardened criminals. They see the worst of humanity & they respond with the best of the American Spirit. America’s LEOs have earned the everlasting gratitude of our Nation!",
			"You don’t hand matches to an arsonist, and you don’t give power to an angry left-wing mob. Democrats have become too EXTREME and TOO DANGEROUS to govern. Republicans believe in the rule of law - not the rule of the mob. VOTE REPUBLICAN!",
			"The crowd in front of the U.S. Supreme Court is tiny, looks like about 200 people (& most are onlookers) - that wouldn’t even fill the first couple of rows of our Kansas Rally, or any of our Rallies for that matter! The Fake News Media tries to make it look sooo big, & it’s not!",
			"I applaud and congratulate the U.S. Senate for confirming our GREAT NOMINEE, Judge Brett Kavanaugh, to the United States Supreme Court. Later today, I will sign his Commission of Appointment, and he will be officially sworn in. Very exciting!",
			"I have asked Steve Daines, our great Republican Senator from Montana, to attend his daughter Annie’s wedding rather than coming to today’s vote. Steve was ready to do whatever he had to, but we had the necessary number. To the Daines Family, congratulations-have a wonderful day!",
			"Women for Kavanaugh, and many others who support this very good man, are gathering all over Capitol Hill in preparation for a 3-5 P.M. VOTE. It is a beautiful thing to see - and they are not paid professional protesters who are handed expensive signs. Big day for America!",
			"The very rude elevator screamers are paid professionals only looking to make Senators look bad. Don’t fall for it! Also, look at all of the professionally made identical signs. Paid for by Soros and others. These are not signs made in the basement from love! #Troublemakers",
			"I see it each time I go out to Rallies in order to help some of our great Republican candidates. VOTERS ARE REALLY ANGRY AT THE VICIOUS AND DESPICABLE WAY DEMOCRATS ARE TREATING BRETT KAVANAUGH! He and his wonderful family deserve much better.",
			"Wow, such enthusiasm and energy for Judge Brett Kavanaugh. Look at the Energy, look at the Polls. Something very big is happening. He is a fine man and great intellect. The country is with him all the way!",
			"The harsh and unfair treatment of Judge Brett Kavanaugh is having an incredible upward impact on voters. The PEOPLE get it far better than the politicians. Most importantly, this great life cannot be ruined by mean & despicable Democrats and totally uncorroborated allegations!",
			"The Stock Market just reached an All-Time High during my Administration for the 102nd Time, a presidential record, by far, for less than two years. So much potential as Trade and Military Deals are completed.",
			"The Failing New York Times did something I have never seen done before. They used the concept of “time value of money” in doing a very old, boring and often told hit piece on me. Added up, this means that 97% of their stories on me are bad. Never recovered from bad election call!",
			"Today, my Administration provided HISTORIC levels of funding to improve school safety through STOP School Violence grants – a top priority for @sandyhook. I am committed to keeping our children SAFE in their schools!",
			"THE ONLY REASON TO VOTE FOR A DEMOCRAT IS IF YOU’RE TIRED OF WINNING!",
			"Wow! Just starting to hear the Democrats, who are only thinking Obstruct and Delay, are starting to put out the word that the “time” and “scope” of FBI looking into Judge Kavanaugh and witnesses is not enough. Hello! For them, it will never be enough - stay tuned and watch!",
			"So if African-American unemployment is now at the lowest number in history, median income the highest, and you then add all of the other things I have done, how do Democrats, who have done NOTHING for African-Americans but TALK, win the Black Vote?  And it will only get better!",
			"Like many, I don’t watch Saturday Night Live (even though I past hosted it) - no longer funny, no talent or charm. It is just a political ad for the Dems. Word is that Kanye West, who put on a MAGA hat after the show (despite being told “no”), was great. He’s leading the charge!",
			"NBC News incorrectly reported (as usual) that I was limiting the FBI investigation of Judge Kavanaugh, and witnesses, only to certain people. Actually, I want them to interview whoever they deem appropriate, at their discretion. Please correct your reporting!",
			"Senator Richard Blumenthal must talk about his fraudulent service in Vietnam, where for 12 years he told the people of Connecticut, as their Attorney General, that he was a great Marine War Hero. Talked about his many battles of near death, but was never in Vietnam. Total Phony!",
			"Judge Kavanaugh showed America exactly why I nominated him. His testimony was powerful, honest, and riveting. Democrats’ search and destroy strategy is disgraceful and this process has been a total sham and effort to delay, obstruct, and resist. The Senate must vote!",
			"Avenatti is a third rate lawyer who is good at making false accusations, like he did on me and like he is now doing on Judge Brett Kavanaugh. He is just looking for attention and doesn’t want people to look at his past record and relationships - a total low-life!",
			"The Democrats are playing a high level CON GAME in their vicious effort to destroy a fine person. It is called the politics of destruction. Behind the scene the Dems are laughing. Pray for Brett Kavanaugh and his family!",
			"Will be speaking at the United Nations this morning. Our country is much stronger and much richer than it was when I took office less than two years ago. We are also MUCH safer!",
			"The Democrats are working hard to destroy a wonderful man, and a man who has the potential to be one of our greatest Supreme Court Justices ever, with an array of False Accusations the likes of which have never been seen before!",
			"Prime Minster @AbeShinzo is coming up to Trump Tower for dinner but, most importantly, he just had a great landslide victory in Japan. I will congratulate him on behalf of the American people!",
			"Going to New York. Will be with Prime Minister Abe of Japan tonight, talking Military and Trade. We have done much to help Japan, would like to see more of a reciprocal relationship. It will all work out!",
			"Senator Feinstein and the Democrats held the letter for months, only to release it with a bang after the hearings were OVER - done very purposefully to Obstruct & Resist & Delay. Let her testify, or not, and TAKE THE VOTE!",
			"I met with the DOJ concerning the declassification of various UNREDACTED documents. They agreed to release them but stated that so doing may have a perceived negative impact on the Russia probe. Also, key Allies’ called to ask not to release. Therefore, the Inspector General.....",
			"The radical left lawyers want the FBI to get involved NOW. Why didn’t someone call the FBI 36 years ago?",
			"I have no doubt that, if the attack on Dr. Ford was as bad as she says, charges would have been immediately filed with local Law Enforcement Authorities by either her or her loving parents. I ask that she bring those filings forward so that we can learn  date, time, and place!",
			"Judge Brett Kavanaugh is a fine man, with an impeccable reputation, who is under assault by radical left wing politicians who don’t want to know the answers, they just want to destroy and delay. Facts don’t matter. I go through this with them every single day in D.C.",
			"Congratulations to my good friend Prime Minister @AbeShinzo on his HUGE election victory in Japan. I’m looking forward to many more years of working together. See you in New York next week!🇺🇸🇯🇵",
			"I want to know, where is the money for Border Security and the WALL in this ridiculous Spending Bill, and where will it come from after the Midterms? Dems are obstructing Law Enforcement and Border Security. REPUBLICANS MUST FINALLY GET TOUGH!",
			"Financial and jobs numbers are fantastic. There are plenty of new, high paying jobs available in our great and very vibrant economy. If you are not happy where you are, start looking - but also remember, our economy is only getting better. Vote in Midterms!",
			"Just returned to the White House from the Great States of North Carolina and South Carolina where incredible work is being done on the ongoing fight against hurricane Florence. Tremendous talent and spirit!",
			"Kim Jong Un has agreed to allow Nuclear inspections, subject to final negotiations, and to permanently dismantle a test site and launch pad in the presence of international experts. In the meantime there will be no Rocket or Nuclear testing. Hero remains to continue being........",
			"The Supreme Court is one of the main reasons I got elected President. I hope Republican Voters, and others, are watching, and studying, the Democrats Playbook.",
			"China has openly stated that they are actively trying to impact and change our election by attacking our farmers, ranchers and industrial workers because of their loyalty to me. What China does not understand is that these people are great patriots and fully understand that.....",
			"Immediately after Comey’s firing Peter Strzok texted to his lover, Lisa Page “We need to Open the case we’ve been waiting on now while Andy (McCabe, also fired) is acting. Page answered, “We need to lock in (redacted). In a formal chargeable way. Soon.” Wow, a conspiracy caught?",
			"“Lisa Page Testimony- NO EVIDENCE OF COLLUSION BEFORE MUELLER APPOINTMENT.” @FoxNews by Catherine Herridge. Therefore, the case should never have been allowed to be brought. It is a totally illegal Witch Hunt!",
			"Best economic numbers in decades. If the Democrats take control, kiss your newfound wealth goodbye!",
			"The illegal Mueller Witch Hunt continues in search of a crime. There was never Collusion with Russia, except by the Clinton campaign, so the 17 Angry Democrats are looking at anything they can find. Very unfair and BAD for the country. ALSO, not allowed under the LAW!",
			"Five deaths have been recorded thus far with regard to hurricane Florence! Deepest sympathies and warmth go out to the families and friends of the victims. May God be with them!",
			"When will Republican leadership learn that they are being played like a fiddle by the Democrats on Border Security and Building the Wall? Without Borders, we don’t have a country. With Open Borders, which the Democrats want, we have nothing but crime! Finish the Wall!",
			"While my (our) poll numbers are good, with the Economy being the best ever, if it weren’t for the Rigged Russian Witch Hunt, they would be 25 points higher! Highly conflicted Bob Mueller & the 17 Angry Democrats are using this Phony issue to hurt us in the Midterms. No Collusion!",
			"John Kerry had illegal meetings with the very hostile Iranian Regime, which can only serve to undercut our great work to the detriment of the American people. He told them to wait out the Trump Administration! Was he registered under the Foreign Agents Registration Act? BAD!",
			"Senator Debbie Stabenow and the Democrats are totally against approving the Farm Bill. They are fighting tooth and nail to not allow our Great Farmers to get what they so richly deserve. Work requirements are imperative and the Dems are a NO. Not good!",
			"The Wall Street Journal has it wrong, we are under no pressure to make a deal with China, they are under pressure to make a deal with us. Our markets are surging, theirs are collapsing. We will soon be taking in Billions in Tariffs & making products at home. If we meet, we meet?",
			"3000 people did not die in the two hurricanes that hit Puerto Rico. When I left the Island, AFTER the storm had hit, they had anywhere from 6 to 18 deaths. As time went by it did not go up by much. Then, a long time later, they started to report really large numbers, like 3000...",
			".....This was done by the Democrats in order to make me look as bad as possible when I was successfully raising Billions of Dollars to help rebuild Puerto Rico. If a person died for any reason, like old age, just add them onto the list. Bad politics. I love Puerto Rico!",
			"More text messages between former FBI employees Peter Strzok and Lisa Page are a disaster and embarrassment to the FBI & DOJ. This should never have happened but we are learning more and more by the hour. “Others were leaking like mad” in order to get the President! ........",
			"The problem with banker Jamie Dimon running for President is that he doesn’t have the aptitude or “smarts” & is a poor public speaker & nervous mess - otherwise he is wonderful. I’ve made a lot of bankers, and others, look much smarter than they are with my great economic policy",
			"We got A Pluses for our recent hurricane work in Texas and Florida (and did an unappreciated great job in Puerto Rico, even though an inaccessible island with very poor electricity and a totally incompetent Mayor of San Juan). We are ready for the big one that is coming!",
			"Rudy Giuliani did a GREAT job as Mayor of NYC during the period of September 11th. His leadership, bravery and skill must never be forgotten. Rudy is a TRUE WARRIOR!",
			"New Strzok-Page texts reveal “Media Leak Strategy.”  @FoxNews  So terrible, and NOTHING is being done at DOJ or FBI - but the world is watching, and they get it completely.",
			"My people just informed me that this is one of the worst storms to hit the East Coast in many years. Also, looking like a direct hit on North Carolina, South Carolina and Virginia. Please be prepared, be careful and be SAFE!",
			"Chuck Schumer is holding up 320 appointments (Ambassadors, Executives, etc.) of great people who have left jobs and given up so much in order to come into Government. Schumer and the Democrats continue to OBSTRUCT!",
			"I wanted to make sure — unlike most politicians, that what I said was correct. Not make a quick statement. The statement I made on Saturday, the first statement, was a fine statement. But you don’t make statements that direct unless you know the fact. It takes a little while to get the facts. You still don’t know the facts, and it’s a very, very important process to me, and it’s a very important statement, so I don’t want to go quickly and just make a statement for the sake of making a political statement. I want to know the facts. If you go back to — I brought it. I brought it. I brought it. As I said — remember this, Saturday — we condemn in the strongest possible terms this egregious display of hatred, bigotry and violence. It has no place in America, and then I went on from there. Now, here’s the thing. Excuse me, excuse me. Take it nice and easy. Here’s the thing. When I make a statement, I like to be correct. I want the facts. This event just happened. In fact, a lot of the event didn’t even happen yet, as we were speaking. This event just happened. Before I make a statement, I need the facts, so I don’t want to rush into a statement. So, making the statement when I made it was excellent. In fact, the young woman, who I hear is a fantastic young woman — and it was on NBC — her mother wrote me and said — through I guess Twitter, social media — the nicest things, and I very much appreciated that. I hear she was a fine, really actually an incredible young woman. But her mother on Twitter thanked me for what I said. And honestly, if the press were not fake and if it was honest, the press would have said what I said was very nice. But unlike you and unlike — excuse me — unlike you and unlike the media, before I make a statement I like to know the facts."
		]
}